In [1]:
import gzip            
import io              
import numpy as np
import pandas as pd    
import pymysql.cursors 
import rdflib
from rdflib import Namespace
import urllib.request 
import math

import matplotlib.pyplot as plt
plt.style.use('ggplot')

%matplotlib inline

# Connect to the database

connection = pymysql.connect(host='hosting.nyu.edu',
                             user='cmrougha_adsq',
                             password='###REPLACE###',
                             db='cmrougha_adsq2017',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)

# RDF and Queries

Search for the header 'Some Queries' to skip to the queries run on the resultant RDF graph.

Initial work experimented with converting a number of different tables from the SQL database into RDF, but this notebook focuses on one table newly created this week, `17.3.9_pinAstr_all`. This table combines all information drawn from Pinakes with new, randomly generated identifiers (columns starting with `astrID_`) for each author, work, witness of that work, and manuscript. This allows for easier work with the hundreds of non-Little Astronomy texts that have been included in the database (formerly only Little Astronomy texts and authors had received unique identifiers).

This table, `17.3.9_pinAstr_all`, is not at all in any normal forms, but the notebook uses various SQL queries to pull out columns with distinct values that are then input into the RDF graph.

The full table has 2,871 columns and 26 rows. A sample of the table is below:

In [143]:
sql = """
SELECT * FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

,witness,astrID_wi,MS,astrID_ms,Pays,Ville,Depot,Fonds,Cote,Folios,...,Identifiant,Recension,BHG,DateLit.,Siècle,Date,Commentaire,Contenu,Rev.,Bibliographies
0,6769_11734,4512229,11734,26250,Magyarország,Budapest,Országos Széchényi Könyvtár,fonds principal,4° Gr. 01 (Kubinyi 10),002-30*,...,,,,,16,,,,,
1,1484_11734,4739938,11734,26250,Magyarország,Budapest,Országos Széchényi Könyvtár,fonds principal,4° Gr. 01 (Kubinyi 10),030-53v*,...,,,,,16,,,,,
2,913_11734,9876248,11734,26250,Magyarország,Budapest,Országos Széchényi Könyvtár,fonds principal,4° Gr. 01 (Kubinyi 10),066v-69v,...,,,,,16,,,,,
3,969_11734,6792546,11734,26250,Magyarország,Budapest,Országos Széchényi Könyvtár,fonds principal,4° Gr. 01 (Kubinyi 10),"074v-140 , p. 280-288",...,,,,,16,,,,,
4,12764_11895,3068424,11895,34044,United Kingdom,Cambridge,Queen's College Libr.,fonds principal,19,001-233,...,,,,,16,,Libb 1-9,,,

## A Function to convert to RDF

In [12]:
def convertToRDF(g,df,primaryKey):
    pseudo_triples = pd.melt(df,id_vars=primaryKey)
    for t in pseudo_triples.iterrows():
        for resourceKey in resourceSyntax:
            if primaryKey in resourceSyntax[resourceKey]:
                s = rdflib.URIRef(resourceKey + t[1][primaryKey])
    
        for verbKey in verbs:
            if t[1]['variable'] in verbs[verbKey]:
                p = rdflib.URIRef(verbKey)
            
        g.add((s,rdflib.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),rdflib.URIRef('http://www.w3.org/2004/02/skos/core#Concept')))

        if t[1]['value'] == None or t[1]['value'] == '':
            print(t)
        elif isinstance(t[1]['value'], float) and math.isnan(t[1]['value']):
            print(t)
        else:
            if t[1]['variable'] in literals:
                if t[1]['variable'] in languages:
                    o = rdflib.Literal(t[1]['value'],lang=languages[t[1]['variable']])
                else:
                    o = rdflib.Literal(t[1]['value'])
                g.add((s,p,o))
            
            elif t[1]['variable'] in numerics:
                o = rdflib.Literal(int(t[1]['value']))
                g.add((s,p,o))
    
            elif t[1]['variable'] in resources:
                for resourceKey in resourceSyntax:
                    if t[1]['variable'] in resourceSyntax[resourceKey]:
                        o = rdflib.URIRef(resourceKey + str(t[1]['value']))
                        g.add((s,p,o))
        
            else:
                print('Error: Unknown whether %s is a literal or resource.' % t[1]['variable'])
    return g

# RDF Conversion

## Geographic Information

### MS to Institution

In [9]:
sql = """
SELECT DISTINCT astrID_ms, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Depot,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS institution
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_ms                institution
0     26250  OrszágosSzéchényiKönyvtár
1     34044          QueensCollegeLibr
2     65283             TrinityCollege
3     48846             TrinityCollege
4     34813          UniversityLibrary

In [11]:
# astrID_ms, Depot from `17.3.9_pinAstr_all`

literals = list()

resources = list()
resources.append('astrID_ms')
resources.append('institution')

numerics = list()

verbs = dict()
verbs['http://www.w3.org/2004/02/skos/core#prefLabel'] = list()

verbs['http://example.org/vocab/locatedIn'] = list()
verbs['http://example.org/vocab/locatedIn'].append('institution')

resourceSyntax = dict()
resourceSyntax['http://example.org/id/'] = list()
resourceSyntax['http://example.org/id/'].append('astrID_ms')
resourceSyntax['http://example.org/id/'].append('institution')

In [13]:
g = rdflib.Graph()

In [14]:
primaryKey = 'astrID_ms'

g = convertToRDF(g,df,primaryKey)

In [17]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/35515,http://example.org/vocab/locatedIn,http://example.org/id/BodleianLibrary
1,http://example.org/id/49015,http://example.org/vocab/locatedIn,http://example.org/id/BibliothèquenationaledeF...
2,http://example.org/id/10018,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
3,http://example.org/id/86643,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/85473,http://example.org/vocab/locatedIn,http://example.org/id/BodleianLibrary

### Institution to Pinakes Label

In [18]:
sql = """
SELECT DISTINCT Depot, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Depot,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS institution
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

                                 Depot                     institution
0          Országos Széchényi Könyvtár       OrszágosSzéchényiKönyvtár
1                Queen's College Libr.               QueensCollegeLibr
2                      Trinity College                  TrinityCollege
3                   University Library               UniversityLibrary
4  Thirlestaine House, coll. Phillipps  ThirlestaineHousecollPhillipps

In [21]:
# Depot from `17.3.9_pinAstr_all`

literals.append('Depot')

verbs['http://www.w3.org/2004/02/skos/core#prefLabel'].append('Depot')

languages = dict()

In [22]:
primaryKey = 'institution'

g = convertToRDF(g,df,primaryKey)

In [24]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/35515,http://example.org/vocab/locatedIn,http://example.org/id/BodleianLibrary
1,http://example.org/id/49015,http://example.org/vocab/locatedIn,http://example.org/id/BibliothèquenationaledeF...
2,http://example.org/id/10018,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
3,http://example.org/id/BibliotecaMediceaLaurenz...,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/86643,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

### Institution to City

In [25]:
sql = """
SELECT DISTINCT REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Ville,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS city, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Depot,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS institution
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

         city                     institution
0    Budapest       OrszágosSzéchényiKönyvtár
1   Cambridge               QueensCollegeLibr
2   Cambridge                  TrinityCollege
3   Cambridge               UniversityLibrary
4  Cheltenham  ThirlestaineHousecollPhillipps

In [26]:
# Depot, Ville from `17.3.9_pinAstr_all`

resources.append('city')

verbs['http://example.org/vocab/locatedIn'].append('city')

resourceSyntax['http://example.org/id/'].append('city')

In [27]:
primaryKey = 'institution'

g = convertToRDF(g,df,primaryKey)

In [29]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/35515,http://example.org/vocab/locatedIn,http://example.org/id/BodleianLibrary
1,http://example.org/id/49015,http://example.org/vocab/locatedIn,http://example.org/id/BibliothèquenationaledeF...
2,http://example.org/id/10018,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
3,http://example.org/id/BibliotecaMediceaLaurenz...,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/86643,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

### City to Pinakes Label

In [32]:
sql = """
SELECT DISTINCT Ville, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Ville,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS city
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

              Ville           city
0          Budapest       Budapest
1         Cambridge      Cambridge
2        Cheltenham     Cheltenham
3      Chicago (IL)      ChicagoIL
4  Cologny (Genève)  ColognyGenève

In [31]:
# Ville from `17.3.9_pinAstr_all`

literals.append('Ville')

verbs['http://www.w3.org/2004/02/skos/core#prefLabel'].append('Ville')

languages = dict()

In [33]:
primaryKey = 'city'

g = convertToRDF(g,df,primaryKey)

In [39]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/BibliotecaMediceaLaurenz...,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
1,http://example.org/id/27520,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaApostolicaVati...
2,http://example.org/id/NewberryLibrary,http://www.w3.org/2004/02/skos/core#prefLabel,Newberry Library
3,http://example.org/id/36188,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/36188,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaCasanatense

### City to Country

In [36]:
sql = """
SELECT DISTINCT REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Ville,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS city, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Pays,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS country
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

            city                country
0       Budapest           Magyarország
1      Cambridge          UnitedKingdom
2     Cheltenham          UnitedKingdom
3      ChicagoIL  UnitedStatesofAmerica
4  ColognyGenève                 Suisse

In [37]:
# Pays, Ville from `17.3.9_pinAstr_all`

resources.append('country')

verbs['http://example.org/vocab/locatedIn'].append('country')

resourceSyntax['http://example.org/id/'].append('country')

In [38]:
primaryKey = 'city'

g = convertToRDF(g,df,primaryKey)

In [41]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/BibliotecaMediceaLaurenz...,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
1,http://example.org/id/27520,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaApostolicaVati...
2,http://example.org/id/NewberryLibrary,http://www.w3.org/2004/02/skos/core#prefLabel,Newberry Library
3,http://example.org/id/36188,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/36188,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaCasanatense

### Country to Pinakes Label

In [42]:
sql = """
SELECT DISTINCT Pays, REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(Pays,')',''),'(',''),"'",""),'.',''),',',''),' ','') AS country
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

                       Pays                country
0              Magyarország           Magyarország
1            United Kingdom          UnitedKingdom
2  United States of America  UnitedStatesofAmerica
3                    Suisse                 Suisse
4                    Hellas                 Hellas

In [43]:
# Ville from `17.3.9_pinAstr_all`

literals.append('Pays')

verbs['http://www.w3.org/2004/02/skos/core#prefLabel'].append('Pays')

In [45]:
primaryKey = 'country'

g = convertToRDF(g,df,primaryKey)

In [48]:
result = g.query(
        """SELECT * WHERE {
            ?1s <http://www.w3.org/2004/02/skos/core#prefLabel> ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,3o
0,http://example.org/id/StaatsbibliothekzuBerlin...,Staatsbibliothek zu Berlin (Preussischer Kultu...
1,http://example.org/id/Budapest,Budapest
2,http://example.org/id/Cheltenham,Cheltenham
3,http://example.org/id/ÖsterreichischeNationalb...,Österreichische Nationalbibliothek (ÖNB)
4,http://example.org/id/Belluno,Belluno

## The Manuscripts

### Astr to Pinakes ID and Label

* Perhaps adjust SQL query to give not Pinakes 'ID' but Pinakes URLs instead.

In [51]:
sql = """
SELECT DISTINCT astrID_ms, MS, CONCAT(Fonds, ' ', Cote) AS shelfmark
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_ms     MS                               shelfmark
0     26250  11734  fonds principal 4° Gr. 01 (Kubinyi 10)
1     34044  11895                      fonds principal 19
2     65283  12000          fonds principal O.05.15 (1296)
3     48846  12028          fonds principal O.10.12 (1464)
4     34813  12151          Fonds ancien Dd. III. 86 (173)

In [52]:
# MS, astrID_ms, Fonds, Cote from `17.3.9_pinAstr_all`

literals.append('MS')
literals.append('shelfmark')

verbs['http://example.org/vocab/pinakesLabel'] = list()
verbs['http://example.org/vocab/pinakesLabel'].append('shelfmark')

verbs['http://example.org/vocab/pinakesID'] = list()
verbs['http://example.org/vocab/pinakesID'].append('MS')

In [53]:
primaryKey = 'astrID_ms'

g = convertToRDF(g,df,primaryKey)

In [56]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/38962,http://example.org/vocab/pinakesID,52908
1,http://example.org/id/37642,http://example.org/vocab/pinakesID,53639
2,http://example.org/id/BibliotecaMediceaLaurenz...,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
3,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
4,http://example.org/id/27520,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaApostolicaVati...

### Manuscript to Witness

In [57]:
sql = """
SELECT DISTINCT astrID_ms, astrID_wi
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_ms astrID_wi
0     26250   4512229
1     26250   4739938
2     26250   9876248
3     26250   6792546
4     34044   3068424

In [58]:
# astrID_ms, astrID_wi from `17.3.9_pinAstr_all`

resources.append('astrID_wi')

verbs['http://example.org/vocab/msContains'] = list()
verbs['http://example.org/vocab/msContains'].append('astrID_wi')

resourceSyntax['http://example.org/id/'].append('astrID_wi')

In [59]:
primaryKey = 'astrID_ms'

g = convertToRDF(g,df,primaryKey)

In [61]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
1,http://example.org/id/74476,http://example.org/vocab/msContains,http://example.org/id/6937052
2,http://example.org/id/24255,http://example.org/vocab/msContains,http://example.org/id/6474501
3,http://example.org/id/27520,http://example.org/vocab/locatedIn,http://example.org/id/BibliotecaApostolicaVati...
4,http://example.org/id/50249,http://example.org/vocab/msContains,http://example.org/id/6367870

In [62]:
# REVERSE
# astrID_ms, astrID_wi from `17.3.9_pinAstr_all`

verbs['http://example.org/vocab/inMS'] = list()
verbs['http://example.org/vocab/inMS'].append('astrID_ms')

In [63]:
primaryKey = 'astrID_wi'

g = convertToRDF(g,df,primaryKey)

In [65]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/1593312,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
1,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
2,http://example.org/id/74476,http://example.org/vocab/msContains,http://example.org/id/6937052
3,http://example.org/id/3283681,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/5490346,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

### Witness to Pinakes ID, Folios, and Century

* note: witness is not a real Pinakes ID but was constructed from MS and Work. maybe remove later.

In [66]:
sql = """
SELECT DISTINCT astrID_wi, witness, Folios, `Siècle`
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_wi      witness                 Folios Siècle
0   4512229   6769_11734                002-30*     16
1   4739938   1484_11734               030-53v*     16
2   9876248    913_11734               066v-69v     16
3   6792546    969_11734  074v-140 , p. 280-288     16
4   3068424  12764_11895                001-233     16

In [67]:
# MS, astrID_ms, Fonds, Cote from `17.3.9_pinAstr_all`

literals.append('witness')
literals.append('Folios')
literals.append('Siècle')

verbs['http://example.org/vocab/pinakesID'].append('witness')

verbs['http://example.org/vocab/pinakesFolios'] = list()
verbs['http://example.org/vocab/pinakesFolios'].append('Folios')

verbs['http://example.org/vocab/pinakesCentury'] = list()
verbs['http://example.org/vocab/pinakesCentury'].append('Siècle')

In [68]:
primaryKey = 'astrID_wi'

g = convertToRDF(g,df,primaryKey)

(2865, astrID_wi    5190893
variable      Folios
value
Name: 2865, dtype: object)
(2879, astrID_wi    6217728
variable      Folios
value
Name: 2879, dtype: object)
(2880, astrID_wi    2157240
variable      Folios
value
Name: 2880, dtype: object)
(2881, astrID_wi    6008159
variable      Folios
value
Name: 2881, dtype: object)
(2905, astrID_wi    8453548
variable      Folios
value
Name: 2905, dtype: object)
(2906, astrID_wi    5699821
variable      Folios
value
Name: 2906, dtype: object)
(2907, astrID_wi    9861742
variable      Folios
value
Name: 2907, dtype: object)
(2908, astrID_wi    9174426
variable      Folios
value
Name: 2908, dtype: object)
(2909, astrID_wi    1737086
variable      Folios
value
Name: 2909, dtype: object)
(2910, astrID_wi    2553686
variable      Folios
value
Name: 2910, dtype: object)
(2911, astrID_wi    3215662
variable      Folios
value
Name: 2911, dtype: object)
(2923, astrID_wi    5854917
variable      Folios
value
Name: 2923, dtype: object)
(2924, astrID_wi    7816388
variable      Folios
value
Name: 2924, dtype: object)
(2925, astrID_wi    4441161
variable      Folios
value
Name: 2925, dtype: object)
(2926, astrID_wi    8123795
variable      Folios
value
Name: 2926, dtype: object)
(2927, astrID_wi    9394779
variable      Folios
value
Name: 2927, dtype: object)
(2928, astrID_wi    8678906
variable      Folios
value
Name: 2928, dtype: object)
(2929, astrID_wi    9703894
variable      Folios
value
Name: 2929, dtype: object)
(2930, astrID_wi    9703894
variable      Folios
value
Name: 2930, dtype: object)
(2931, astrID_wi    6999912
variable      Folios
value
Name: 2931, dtype: object)
(2932, astrID_wi    4516238
variable      Folios
value
Name: 2932, dtype: object)
(2933, astrID_wi    3029356
variable      Folios
value
Name: 2933, dtype: object)
(2934, astrID_wi    7074184
variable      Folios
value
Name: 2934, dtype: object)
(2935, astrID_wi    2184618
variable      Folios
value
Name: 2935, dtype: object)
(2936, astrID_wi    7430912
variable      Folios
value
Name: 2936, dtype: object)
(2937, astrID_wi    1189259
variable      Folios
value
Name: 2937, dtype: object)
(2938, astrID_wi    5682904
variable      Folios
value
Name: 2938, dtype: object)
(2939, astrID_wi    2823129
variable      Folios
value
Name: 2939, dtype: object)
(2940, astrID_wi    3552971
variable      Folios
value
Name: 2940, dtype: object)
(2941, astrID_wi    1392928
variable      Folios
value
Name: 2941, dtype: object)
(2942, astrID_wi    4449847
variable      Folios
value
Name: 2942, dtype: object)
(2943, astrID_wi    1920624
variable      Folios
value
Name: 2943, dtype: object)
(2944, astrID_wi    3794528
variable      Folios
value
Name: 2944, dtype: object)
(2945, astrID_wi    2942273
variable      Folios
value
Name: 2945, dtype: object)
(2946, astrID_wi    5248456
variable      Folios
value
Name: 2946, dtype: object)
(2947, astrID_wi    5092758
variable      Folios
value
Name: 2947, dtype: object)
(2948, astrID_wi    7803387
variable      Folios
value
Name: 2948, dtype: object)
(2949, astrID_wi    8544575
variable      Folios
value
Name: 2949, dtype: object)
(2950, astrID_wi    9272564
variable      Folios
value
Name: 2950, dtype: object)
(2951, astrID_wi    8047169
variable      Folios
value
Name: 2951, dtype: object)
(2952, astrID_wi    7297653
variable      Folios
value
Name: 2952, dtype: object)
(2953, astrID_wi    9532486
variable      Folios
value
Name: 2953, dtype: object)
(2954, astrID_wi    2007028
variable      Folios
value
Name: 2954, dtype: object)
(2955, astrID_wi    2356620
variable      Folios
value
Name: 2955, dtype: object)
(2956, astrID_wi    9600179
variable      Folios
value
Name: 2956, dtype: object)
(2957, astrID_wi    3785520
variable      Folios
value
Name: 2957, dtype: object)
(3004, astrID_wi    9668583
variable      Folios
value
Name: 3004, dtype: object)
(3005, astrID_wi    8441821
variable      Folios
value
Name: 3005, dtype: object)
(3006, astrID_wi    2634856
variable      Folios
value
Name: 3006, dtype: object)
(3007, astrID_wi    6703952
variable      Folios
value
Name: 3007, dtype: object)
(3008, astrID_wi    1008055
variable      Folios
value
Name: 3008, dtype: object)
(3009, astrID_wi    4736670
variable      Folios
value
Name: 3009, dtype: object)
(3010, astrID_wi    8358259
variable      Folios
value
Name: 3010, dtype: object)
(3011, astrID_wi    9033638
variable      Folios
value
Name: 3011, dtype: object)
(3252, astrID_wi    9773056
variable      Folios
value
Name: 3252, dtype: object)
(3260, astrID_wi    3140313
variable      Folios
value
Name: 3260, dtype: object)
(3264, astrID_wi    8265082
variable      Folios
value
Name: 3264, dtype: object)
(3265, astrID_wi    7308880
variable      Folios
value
Name: 3265, dtype: object)
(3266, astrID_wi    2808950
variable      Folios
value
Name: 3266, dtype: object)
(3267, astrID_wi    2808950
variable      Folios
value
Name: 3267, dtype: object)
(3268, astrID_wi    3014612
variable      Folios
value
Name: 3268, dtype: object)
(3269, astrID_wi    3312898
variable      Folios
value
Name: 3269, dtype: object)
(3438, astrID_wi    9215788
variable      Folios
value
Name: 3438, dtype: object)
(3440, astrID_wi    8547064
variable      Folios
value
Name: 3440, dtype: object)
(3441, astrID_wi    4247968
variable      Folios
value
Name: 3441, dtype: object)
(3442, astrID_wi    4247968
variable      Folios
value
Name: 3442, dtype: object)
(3443, astrID_wi    7994722
variable      Folios
value
Name: 3443, dtype: object)
(3444, astrID_wi    8814566
variable      Folios
value
Name: 3444, dtype: object)
(3448, astrID_wi    5281132
variable      Folios
value
Name: 3448, dtype: object)
(3452, astrID_wi    3785853
variable      Folios
value
Name: 3452, dtype: object)
(3453, astrID_wi    8852388
variable      Folios
value
Name: 3453, dtype: object)
(3455, astrID_wi    4806094
variable      Folios
value
Name: 3455, dtype: object)
(3456, astrID_wi    8976561
variable      Folios
value
Name: 3456, dtype: object)
(3457, astrID_wi    4570229
variable      Folios
value
Name: 3457, dtype: object)
(3458, astrID_wi    8257235
variable      Folios
value
Name: 3458, dtype: object)
(3459, astrID_wi    8859061
variable      Folios
value
Name: 3459, dtype: object)
(3460, astrID_wi    6303685
variable      Folios
value
Name: 3460, dtype: object)
(3461, astrID_wi    1138680
variable      Folios
value
Name: 3461, dtype: object)
(3462, astrID_wi    5420074
variable      Folios
value
Name: 3462, dtype: object)
(3463, astrID_wi    3698437
variable      Folios
value
Name: 3463, dtype: object)
(3464, astrID_wi    6210660
variable      Folios
value
Name: 3464, dtype: object)
(3496, astrID_wi    5685940
variable      Folios
value
Name: 3496, dtype: object)
(3497, astrID_wi    5351653
variable      Folios
value
Name: 3497, dtype: object)
(3516, astrID_wi    2013539
variable      Folios
value
Name: 3516, dtype: object)
(3629, astrID_wi    3530888
variable      Folios
value
Name: 3629, dtype: object)
(3630, astrID_wi    7217535
variable      Folios
value
Name: 3630, dtype: object)
(3829, astrID_wi    7393868
variable      Folios
value
Name: 3829, dtype: object)
(3830, astrID_wi    5767986
variable      Folios
value
Name: 3830, dtype: object)
(3831, astrID_wi    9152165
variable      Folios
value
Name: 3831, dtype: object)
(3840, astrID_wi    1113586
variable      Folios
value
Name: 3840, dtype: object)
(3841, astrID_wi    1672269
variable      Folios
value
Name: 3841, dtype: object)
(3842, astrID_wi    2643371
variable      Folios
value
Name: 3842, dtype: object)
(3843, astrID_wi    2628410
variable      Folios
value
Name: 3843, dtype: object)
(3844, astrID_wi    8088207
variable      Folios
value
Name: 3844, dtype: object)
(3845, astrID_wi    8255450
variable      Folios
value
Name: 3845, dtype: object)
(3846, astrID_wi    3696187
variable      Folios
value
Name: 3846, dtype: object)
(3847, astrID_wi    3878508
variable      Folios
value
Name: 3847, dtype: object)
(3989, astrID_wi    4238445
variable      Folios
value
Name: 3989, dtype: object)
(4024, astrID_wi    3413674
variable      Folios
value
Name: 4024, dtype: object)
(4039, astrID_wi    5900183
variable      Folios
value
Name: 4039, dtype: object)
(4055, astrID_wi    2736193
variable      Folios
value
Name: 4055, dtype: object)
(4216, astrID_wi    5541184
variable      Folios
value
Name: 4216, dtype: object)
(4233, astrID_wi    1264601
variable      Folios
value
Name: 4233, dtype: object)
(4234, astrID_wi    5596709
variable      Folios
value
Name: 4234, dtype: object)
(4308, astrID_wi    4418417
variable      Folios
value
Name: 4308, dtype: object)
(4314, astrID_wi    1371470
variable      Folios
value
Name: 4314, dtype: object)
(4668, astrID_wi    4516880
variable      Folios
value
Name: 4668, dtype: object)
(4670, astrID_wi    2649168
variable      Folios
value
Name: 4670, dtype: object)
(4671, astrID_wi    6055176
variable      Folios
value
Name: 4671, dtype: object)
(4672, astrID_wi    1138549
variable      Folios
value
Name: 4672, dtype: object)
(4673, astrID_wi    2130889
variable      Folios
value
Name: 4673, dtype: object)
(4674, astrID_wi    4505083
variable      Folios
value
Name: 4674, dtype: object)
(4699, astrID_wi    2414804
variable      Folios
value
Name: 4699, dtype: object)
(4714, astrID_wi    4820236
variable      Folios
value
Name: 4714, dtype: object)
(4715, astrID_wi    6724859
variable      Folios
value
Name: 4715, dtype: object)
(4716, astrID_wi    3542858
variable      Folios
value
Name: 4716, dtype: object)
(4717, astrID_wi    1819388
variable      Folios
value
Name: 4717, dtype: object)
(4718, astrID_wi    5682689
variable      Folios
value
Name: 4718, dtype: object)
(4719, astrID_wi    3755944
variable      Folios
value
Name: 4719, dtype: object)
(4720, astrID_wi    3838496
variable      Folios
value
Name: 4720, dtype: object)
(4721, astrID_wi    6640981
variable      Folios
value
Name: 4721, dtype: object)
(4722, astrID_wi    2212311
variable      Folios
value
Name: 4722, dtype: object)
(4723, astrID_wi    6928683
variable      Folios
value
Name: 4723, dtype: object)
(4737, astrID_wi    2005697
variable      Folios
value
Name: 4737, dtype: object)
(4738, astrID_wi    8823125
variable      Folios
value
Name: 4738, dtype: object)
(4739, astrID_wi    1869352
variable      Folios
value
Name: 4739, dtype: object)
(4830, astrID_wi    7982288
variable      Folios
value
Name: 4830, dtype: object)
(4831, astrID_wi    2761713
variable      Folios
value
Name: 4831, dtype: object)
(4888, astrID_wi    6077237
variable      Folios
value
Name: 4888, dtype: object)
(4945, astrID_wi    9891958
variable      Folios
value
Name: 4945, dtype: object)
(5208, astrID_wi    3926754
variable      Folios
value
Name: 5208, dtype: object)
(5209, astrID_wi    8020751
variable      Folios
value
Name: 5209, dtype: object)
(5210, astrID_wi    9690334
variable      Folios
value
Name: 5210, dtype: object)
(5211, astrID_wi    5246664
variable      Folios
value
Name: 5211, dtype: object)
(5212, astrID_wi    4940209
variable      Folios
value
Name: 5212, dtype: object)
(5213, astrID_wi    5003576
variable      Folios
value
Name: 5213, dtype: object)
(5214, astrID_wi    6519388
variable      Folios
value
Name: 5214, dtype: object)
(5215, astrID_wi    1555295
variable      Folios
value
Name: 5215, dtype: object)
(5216, astrID_wi    2700849
variable      Folios
value
Name: 5216, dtype: object)
(5217, astrID_wi    7153800
variable      Folios
value
Name: 5217, dtype: object)
(5239, astrID_wi    7472961
variable      Folios
value
Name: 5239, dtype: object)
(5299, astrID_wi    7239571
variable      Folios
value
Name: 5299, dtype: object)
(5608, astrID_wi    8975031
variable      Folios
value
Name: 5608, dtype: object)
(5641, astrID_wi    4253272
variable      Folios
value
Name: 5641, dtype: object)
(5642, astrID_wi    4380288
variable      Folios
value
Name: 5642, dtype: object)
(5643, astrID_wi    5993464
variable      Folios
value
Name: 5643, dtype: object)
(5644, astrID_wi    5546212
variable      Folios
value
Name: 5644, dtype: object)
(5645, astrID_wi    5857477
variable      Folios
value
Name: 5645, dtype: object)
(5646, astrID_wi    1850847
variable      Folios
value
Name: 5646, dtype: object)
(5648, astrID_wi    7776294
variable      Folios
value
Name: 5648, dtype: object)
(5649, astrID_wi    3393991
variable      Folios
value
Name: 5649, dtype: object)
(5693, astrID_wi    2754311
variable      Folios
value
Name: 5693, dtype: object)
(5708, astrID_wi    9275358
variable      Folios
value
Name: 5708, dtype: object)
(5729, astrID_wi    9460137
variable      Siècle
value
Name: 5729, dtype: object)
(5739, astrID_wi    6217728
variable      Siècle
value
Name: 5739, dtype: object)
(5740, astrID_wi    2157240
variable      Siècle
value
Name: 5740, dtype: object)
(5741, astrID_wi    6008159
variable      Siècle
value
Name: 5741, dtype: object)
(5765, astrID_wi    8453548
variable      Siècle
value
Name: 5765, dtype: object)
(5766, astrID_wi    5699821
variable      Siècle
value
Name: 5766, dtype: object)
(5783, astrID_wi    5854917
variable      Siècle
value
Name: 5783, dtype: object)
(5784, astrID_wi    7816388
variable      Siècle
value
Name: 5784, dtype: object)
(5785, astrID_wi    4441161
variable      Siècle
value
Name: 5785, dtype: object)
(5786, astrID_wi    8123795
variable      Siècle
value
Name: 5786, dtype: object)
(5787, astrID_wi    9394779
variable      Siècle
value
Name: 5787, dtype: object)
(5789, astrID_wi    9703894
variable      Siècle
value
Name: 5789, dtype: object)
(5793, astrID_wi    3029356
variable      Siècle
value
Name: 5793, dtype: object)
(5794, astrID_wi    7074184
variable      Siècle
value
Name: 5794, dtype: object)
(5796, astrID_wi    7430912
variable      Siècle
value
Name: 5796, dtype: object)
(5797, astrID_wi    1189259
variable      Siècle
value
Name: 5797, dtype: object)
(5799, astrID_wi    2823129
variable      Siècle
value
Name: 5799, dtype: object)
(5800, astrID_wi    3552971
variable      Siècle
value
Name: 5800, dtype: object)
(5801, astrID_wi    1392928
variable      Siècle
value
Name: 5801, dtype: object)
(5802, astrID_wi    4449847
variable      Siècle
value
Name: 5802, dtype: object)
(5803, astrID_wi    1920624
variable      Siècle
value
Name: 5803, dtype: object)
(5804, astrID_wi    3794528
variable      Siècle
value
Name: 5804, dtype: object)
(5805, astrID_wi    2942273
variable      Siècle
value
Name: 5805, dtype: object)
(5806, astrID_wi    5248456
variable      Siècle
value
Name: 5806, dtype: object)
(5807, astrID_wi    5092758
variable      Siècle
value
Name: 5807, dtype: object)
(5808, astrID_wi    7803387
variable      Siècle
value
Name: 5808, dtype: object)
(5811, astrID_wi    8047169
variable      Siècle
value
Name: 5811, dtype: object)
(5812, astrID_wi    7297653
variable      Siècle
value
Name: 5812, dtype: object)
(5813, astrID_wi    9532486
variable      Siècle
value
Name: 5813, dtype: object)
(5815, astrID_wi    2356620
variable      Siècle
value
Name: 5815, dtype: object)
(5816, astrID_wi    9600179
variable      Siècle
value
Name: 5816, dtype: object)
(5817, astrID_wi    3785520
variable      Siècle
value
Name: 5817, dtype: object)
(5818, astrID_wi    6479559
variable      Siècle
value
Name: 5818, dtype: object)
(5819, astrID_wi    9799626
variable      Siècle
value
Name: 5819, dtype: object)
(5820, astrID_wi    2381569
variable      Siècle
value
Name: 5820, dtype: object)
(5821, astrID_wi    1979454
variable      Siècle
value
Name: 5821, dtype: object)
(5822, astrID_wi    8293992
variable      Siècle
value
Name: 5822, dtype: object)
(5823, astrID_wi    5748366
variable      Siècle
value
Name: 5823, dtype: object)
(5824, astrID_wi    3256640
variable      Siècle
value
Name: 5824, dtype: object)
(5825, astrID_wi    6251400
variable      Siècle
value
Name: 5825, dtype: object)
(5826, astrID_wi    4595369
variable      Siècle
value
Name: 5826, dtype: object)
(5827, astrID_wi    2099546
variable      Siècle
value
Name: 5827, dtype: object)
(5828, astrID_wi    2630504
variable      Siècle
value
Name: 5828, dtype: object)
(5829, astrID_wi    2071830
variable      Siècle
value
Name: 5829, dtype: object)
(5830, astrID_wi    1735546
variable      Siècle
value
Name: 5830, dtype: object)
(5831, astrID_wi    6920963
variable      Siècle
value
Name: 5831, dtype: object)
(5832, astrID_wi    4583788
variable      Siècle
value
Name: 5832, dtype: object)
(5833, astrID_wi    3528578
variable      Siècle
value
Name: 5833, dtype: object)
(5834, astrID_wi    1041600
variable      Siècle
value
Name: 5834, dtype: object)
(5835, astrID_wi    4692922
variable      Siècle
value
Name: 5835, dtype: object)
(5836, astrID_wi    1803002
variable      Siècle
value
Name: 5836, dtype: object)
(5837, astrID_wi    9198804
variable      Siècle
value
Name: 5837, dtype: object)
(5838, astrID_wi    7065220
variable      Siècle
value
Name: 5838, dtype: object)
(5839, astrID_wi    1181756
variable      Siècle
value
Name: 5839, dtype: object)
(5840, astrID_wi    7807354
variable      Siècle
value
Name: 5840, dtype: object)
(5841, astrID_wi    8114340
variable      Siècle
value
Name: 5841, dtype: object)
(5842, astrID_wi    3265864
variable      Siècle
value
Name: 5842, dtype: object)
(5843, astrID_wi    7897949
variable      Siècle
value
Name: 5843, dtype: object)
(5844, astrID_wi    7807354
variable      Siècle
value
Name: 5844, dtype: object)
(5845, astrID_wi    7816344
variable      Siècle
value
Name: 5845, dtype: object)
(5846, astrID_wi    1248448
variable      Siècle
value
Name: 5846, dtype: object)
(5847, astrID_wi    4500257
variable      Siècle
value
Name: 5847, dtype: object)
(5848, astrID_wi    2227186
variable      Siècle
value
Name: 5848, dtype: object)
(5849, astrID_wi    5642733
variable      Siècle
value
Name: 5849, dtype: object)
(5850, astrID_wi    1643070
variable      Siècle
value
Name: 5850, dtype: object)
(5851, astrID_wi    7688983
variable      Siècle
value
Name: 5851, dtype: object)
(5852, astrID_wi    4917535
variable      Siècle
value
Name: 5852, dtype: object)
(5853, astrID_wi    9870295
variable      Siècle
value
Name: 5853, dtype: object)
(5854, astrID_wi    7816344
variable      Siècle
value
Name: 5854, dtype: object)
(5855, astrID_wi    4919780
variable      Siècle
value
Name: 5855, dtype: object)
(5856, astrID_wi    6189090
variable      Siècle
value
Name: 5856, dtype: object)
(5857, astrID_wi    4446793
variable      Siècle
value
Name: 5857, dtype: object)
(5858, astrID_wi    3455009
variable      Siècle
value
Name: 5858, dtype: object)
(5859, astrID_wi    2706519
variable      Siècle
value
Name: 5859, dtype: object)
(5860, astrID_wi    8302382
variable      Siècle
value
Name: 5860, dtype: object)
(5861, astrID_wi    1153067
variable      Siècle
value
Name: 5861, dtype: object)
(5862, astrID_wi    4635628
variable      Siècle
value
Name: 5862, dtype: object)
(5863, astrID_wi    1231098
variable      Siècle
value
Name: 5863, dtype: object)
(5864, astrID_wi    9668583
variable      Siècle
value
Name: 5864, dtype: object)
(5865, astrID_wi    8441821
variable      Siècle
value
Name: 5865, dtype: object)
(5866, astrID_wi    2634856
variable      Siècle
value
Name: 5866, dtype: object)
(5867, astrID_wi    6703952
variable      Siècle
value
Name: 5867, dtype: object)
(5868, astrID_wi    1008055
variable      Siècle
value
Name: 5868, dtype: object)
(5869, astrID_wi    4736670
variable      Siècle
value
Name: 5869, dtype: object)
(5870, astrID_wi    8358259
variable      Siècle
value
Name: 5870, dtype: object)
(5871, astrID_wi    9033638
variable      Siècle
value
Name: 5871, dtype: object)
(5872, astrID_wi    6657410
variable      Siècle
value
Name: 5872, dtype: object)
(5873, astrID_wi    5911934
variable      Siècle
value
Name: 5873, dtype: object)
(5874, astrID_wi    1661008
variable      Siècle
value
Name: 5874, dtype: object)
(5875, astrID_wi    9850615
variable      Siècle
value
Name: 5875, dtype: object)
(5878, astrID_wi    1363540
variable      Siècle
value

In [70]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/1202805,http://example.org/vocab/pinakesFolios,096v-104v
1,http://example.org/id/7439544,http://example.org/vocab/pinakesID,13115_49479
2,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
3,http://example.org/id/3283681,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/5490346,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

### Witness to Text

In [72]:
sql = """
SELECT DISTINCT astrID_wi, astrID_wo
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_wi astrID_wo
0   4512229    963140
1   4739938    698551
2   9876248    709263
3   6792546    473477
4   3068424    697381

In [73]:
# astrID_wo, astrID_wi from `17.3.9_pinAstr_all`

resources.append('astrID_wo')

verbs['http://example.org/vocab/witnessOf'] = list()
verbs['http://example.org/vocab/witnessOf'].append('astrID_wo')

resourceSyntax['http://example.org/id/'].append('astrID_wo')

In [74]:
primaryKey = 'astrID_wi'

g = convertToRDF(g,df,primaryKey)

In [76]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/1202805,http://example.org/vocab/pinakesFolios,096v-104v
1,http://example.org/id/7439544,http://example.org/vocab/pinakesID,13115_49479
2,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
3,http://example.org/id/3283681,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/5490346,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

In [77]:
# REVERSE
# astrID_wo, astrID_wi from `17.3.9_pinAstr_all`

verbs['http://example.org/vocab/hasWitness'] = list()
verbs['http://example.org/vocab/hasWitness'].append('astrID_wi')

In [78]:
primaryKey = 'astrID_wo'

g = convertToRDF(g,df,primaryKey)

In [80]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/1202805,http://example.org/vocab/pinakesFolios,096v-104v
1,http://example.org/id/7439544,http://example.org/vocab/pinakesID,13115_49479
2,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
3,http://example.org/id/840877,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/3283681,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

## Texts and Authors
### astrID_wo to Pinakes Info, astrID_au

In [81]:
sql = """
SELECT DISTINCT astrID_wo, workID, Oeuvre, astrID_au
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

,astrID_wo,workID,Oeuvre,astrID_au
0,963140,6769,Hermippus Siue De Astrologia,8487
1,698551,1484,Commentaria in Ptolemaei canones,3114
2,709263,913,Canon urbium insignium,8572
3,473477,969,"Canones Prompti (manuale : Ed. Heiberg Ii, P. ...",8572
4,697381,12764,Syntaxis mathematica (Almageste) (Lib. I-XIII ...,8572

In [82]:
# astrID_wo, workID, Oeuvre, astrID_au from `17.3.9_pinAstr_all`

literals.append('workID')
literals.append('Oeuvre')

resources.append('astrID_au')

verbs['http://example.org/vocab/pinakesID'].append('workID')

verbs['http://example.org/vocab/pinakesLabel'].append('Oeuvre')

verbs['http://purl.org/dc/elements/1.1/creator'] = list()
verbs['http://purl.org/dc/elements/1.1/creator'].append('astrID_au')

resourceSyntax['http://example.org/id/'].append('astrID_au')

In [83]:
primaryKey = 'astrID_wo'

g = convertToRDF(g,df,primaryKey)

In [87]:
result = g.query(
        """SELECT * WHERE {
            ?1s ?2p ?3o .
                }""")

pd.DataFrame(result.bindings).head()

,1s,2p,3o
0,http://example.org/id/1202805,http://example.org/vocab/pinakesFolios,096v-104v
1,http://example.org/id/7439544,http://example.org/vocab/pinakesID,13115_49479
2,http://example.org/id/10384,http://example.org/vocab/pinakesLabel,fonds principal III C 16
3,http://example.org/id/840877,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept
4,http://example.org/id/3283681,http://www.w3.org/1999/02/22-rdf-syntax-ns#type,http://www.w3.org/2004/02/skos/core#Concept

### Author to Pinakes Info

In [88]:
sql = """
SELECT DISTINCT astrID_au, AuthorID, Auteur
 FROM `17.3.9_pinAstr_all`
 """
with connection.cursor() as cursor:
    cursor.execute(sql)
    names = [ x[0] for x in cursor.description]
    result = cursor.fetchall()
df = pd.DataFrame(result, columns = names)

df.head()

  astrID_au AuthorID                Auteur
0      8487      635     Iohannes Catrones
1      3114     2723    Theon Alexandrinus
2      8572     2416   Ptolemaeus Claudius
3      6152      857              Damianus
4      1282     2785  Triclinius Demetrius

In [89]:
# astrID_au, AuthorID, Auteur from `17.3.9_pinAstr_all`

literals.append('AuthorID')
literals.append('Auteur')

verbs['http://example.org/vocab/pinakesID'].append('AuthorID')

verbs['http://example.org/vocab/pinakesLabel'].append('Auteur')

In [90]:
primaryKey = 'astrID_au'

g = convertToRDF(g,df,primaryKey)

In [93]:
result = g.query(
        """SELECT * WHERE {
            ?1s <http://example.org/vocab/pinakesLabel> ?3o .
                }""")

pd.DataFrame(result.bindings).head()

                             1s                                    3o
0  http://example.org/id/914324                           Onomasticon
1  http://example.org/id/701770      Scholia In Aristotelis Analytica
2    http://example.org/id/1221                      Hierocles quidam
3   http://example.org/id/10384              fonds principal III C 16
4  http://example.org/id/717345  Introductio in Tetrabiblum Ptolemaei

## Some Queries

Finding all texts attributed to Euclid in the Pinakes database.

In [98]:
result = g.query(
        """SELECT * WHERE {
            ?au <http://example.org/vocab/pinakesLabel> 'Euclides' .
            ?wo <http://purl.org/dc/elements/1.1/creator> ?au .
            ?wo <http://example.org/vocab/pinakesLabel> ?la .
                }""")

pd.DataFrame(result.bindings)

,au,la,wo
0,http://example.org/id/5215,Phaenomena,http://example.org/id/721862
1,http://example.org/id/5215,Catoptrica (spur.),http://example.org/id/544877
2,http://example.org/id/5215,Introductio harmonica,http://example.org/id/360545
3,http://example.org/id/5215,Elementa,http://example.org/id/777790
4,http://example.org/id/5215,Epigramma,http://example.org/id/422006
5,http://example.org/id/5215,Sectio canonis,http://example.org/id/425216
6,http://example.org/id/5215,Opera,http://example.org/id/132659
7,http://example.org/id/5215,Data,http://example.org/id/613097
8,http://example.org/id/5215,Optica,http://example.org/id/154837

Count how many texts by a certain author (below Euclid) appears in each manuscript.

In [144]:
pinakes_authorName = 'Euclides'
# For this query it is necessary to know how the author is named
# in the Pinakes database.

result = g.query(
        """
        PREFIX ex: <http://example.org/vocab/>
        PREFIX dc: <http://purl.org/dc/elements/1.1/>
        PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
        SELECT ?ms ?shelfmark (COUNT(*) AS ?c) WHERE {
            ?au ex:pinakesLabel '%s' .
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                """ % pinakes_authorName)

pd.DataFrame(result.bindings)

,c,ms,shelfmark
0,6,http://example.org/id/60423,Staatsbibliothek zu Berlin (Preussischer Kultu...
1,5,http://example.org/id/54144,Biblioteca comunale degli Intronati fonds prin...
2,5,http://example.org/id/51986,Bibliothèque nationale de France (BNF) gr. 2347
3,5,http://example.org/id/48620,Bibliothèque nationale de France (BNF) gr. 2342
4,5,http://example.org/id/27520,Biblioteca Apostolica Vaticana Vat. gr. 192
5,5,http://example.org/id/53234,Biblioteca Ambrosiana fonds principal A 101 su...
6,5,http://example.org/id/38870,Bibliotheek der Rijksuniversiteit BPG 7
7,5,http://example.org/id/38820,Biblioteca Angelica gr. 95
8,4,http://example.org/id/51392,Biblioteca Apostolica Vaticana Vat. gr. 204
9,4,http://example.org/id/97374,Biblioteca Nazionale Marciana gr. Z. 302 (coll...
10,4,http://example.org/id/21139,Biblioteca Nazionale Marciana gr. Z. 301 (coll...
11,4,http://example.org/id/84028,Biblioteca Apostolica Vaticana Ross. 978
12,4,http://example.org/id/10018,Biblioteca Universitaria fonds principal 2048
13,4,http://example.org/id/17320,Biblioteca Apostolica Vaticana Vat. gr. 191
14,4,http://example.org/id/24333,Bibliothèque nationale de France (BNF) gr. 2350
15,3,http://example.org/id/92714,Herzog August Bibliothek Gud. gr. Gud. gr. 036
16,3,http://example.org/id/89276,Biblioteca Apostolica Vaticana Vat. gr. 202
17,3,http://example.org/id/92956,Real Biblioteca fonds principal ?. II. 13 (And...
18,3,http://example.org/id/38782,Bibliothèque nationale de France (BNF) suppl. ...
19,3,http://example.org/id/13457,Bibliothèque nationale de France (BNF) suppl. ...
20,3,http://example.org/id/53448,University Library Fonds ancien Gg. II. 33 (1463)
21,3,http://example.org/id/56874,Biblioteca Nazionale Marciana gr. Z. 303 (coll...
22,3,http://example.org/id/14930,Bibliothèque nationale de France (BNF) gr. 2366
23,2,http://example.org/id/64425,Biblioteca Ambrosiana fonds principal Q 105 su...
24,2,http://example.org/id/63530,Bibliothèque nationale de France (BNF) gr. 2460
25,2,http://example.org/id/40748,Bibliothèque nationale de France (BNF) gr. 2448
26,2,http://example.org/id/91291,Biblioteca nacional de España fonds principal ...
27,2,http://example.org/id/82030,Biblioteca Ambrosiana fonds principal A 071 in...
28,2,http://example.org/id/58660,Biblioteca Nazionale Marciana gr. Z. 322 (coll...
29,2,http://example.org/id/69241,Biblioteca Apostolica Vaticana Reg. gr. 94
...,...,...,...
80,1,http://example.org/id/62037,Bibliotheek der Rijksuniversiteit Scal. gr. 48
81,1,http://example.org/id/58834,Biblioteca Apostolica Vaticana Ottob. gr. 192
82,1,http://example.org/id/27555,Bibliotheek der Rijksuniversiteit Voss. Misc. 18
83,1,http://example.org/id/48404,Lincoln College fonds principal gr. 033
84,1,http://example.org/id/49580,Biblioteca Apostolica Vaticana Vat. gr. 221
85,1,http://example.org/id/17899,Bibliothèque nationale de France (BNF) gr. 2348
86,1,http://example.org/id/51439,Gumnasion fonds principal 0382 (83)
87,1,http://example.org/id/32360,Bibliothèque nationale de France (BNF) suppl. ...
88,1,http://example.org/id/91842,Real Biblioteca fonds principal ?. II. 05 (And...
89,1,http://example.org/id/45543,Det Kongelige Bibliotek GKS 1871 4°
90,1,http://example.org/id/92004,Biblioteca Ambrosiana fonds principal N 289 su...
91,1,http://example.org/id/92917,Bibliothèque nationale de France (BNF) gr. 2349
92,1,http://example.org/id/89978,Bodleian Library Auct. F. 3. 18 (Misc. 092)
93,1,http://example.org/id/91649,Staatsbibliothek zu Berlin (Preussischer Kultu...
94,1,http://example.org/id/10017,Biblioteca Apostolica Vaticana Vat. gr. 1346
95,1,http://example.org/id/26661,Bodleian Library Langbaine 3
96,1,http://example.org/id/74757,Real Biblioteca fonds principal ?. IV. 01 (And...
97,1,http://example.org/id/58936,Bibliothèque nationale de France (BNF) gr. 2008
98,1,http://example.org/id/53339,Biblioteca Apostolica Vaticana Vat. gr. 1379
99,1,http://example.org/id/81231,Bodleian Library Barocci 76
100,1,http://example.org/id/20467,"Thirlestaine House, coll. Phillipps fonds prin..."
101,1,http://example.org/id/34813,University Library Fonds ancien Dd. III. 86 (173)
102,1,http://example.org/id/84606,Biblioteca Apostolica Vaticana Barb. gr. 265
103,1,http://example.org/id/63658,Bibliothèque nationale de France (BNF) gr. 2475
104,1,http://example.org/id/15997,Bibliothèque nationale de France (BNF) gr. 1670
105,1,http://example.org/id/43441,Biblioteca Apostolica Vaticana Pal. gr. 137
106,1,http://example.org/id/54405,Biblioteca Medicea Laurenziana Acq. e Doni 168
107,1,http://example.org/id/41582,Biblioteca Ambrosiana fonds principal B 038 su...
108,1,http://example.org/id/33198,Real Biblioteca fonds principal ?. I. 12 (Andr...
109,1,http://example.org/id/29934,Bibliothèque nationale de France (BNF) suppl. ...

In [136]:
pinakes_authorName = 'Euclides'

result = g.query(
        """
        PREFIX ex: <http://example.org/vocab/>
        PREFIX dc: <http://purl.org/dc/elements/1.1/>
        PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
        SELECT ?au ?ms ?shelfmark ?c WHERE {
        {
        SELECT ?au ?ms ?shelfmark (COUNT(*) AS ?c)  WHERE {
            ?au ex:pinakesLabel 'Euclides' .
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
            BIND('Euclides' AS ?au)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                LIMIT 1
        } UNION {
        SELECT ?au ?ms ?shelfmark (COUNT(*) AS ?c)  WHERE {
            ?au ex:pinakesLabel 'Theodosius Tripolita' .
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
            BIND('Theodosius Tripolita' AS ?au)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                LIMIT 1
        } UNION {
        SELECT ?au ?ms ?shelfmark (COUNT(*) AS ?c)  WHERE {
            ?au ex:pinakesLabel 'Autolycus astronomus' .
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
            BIND('Autolycus astronomus' AS ?au)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                LIMIT 1
        } UNION {
        SELECT ?au ?ms ?shelfmark (COUNT(*) AS ?c)  WHERE {
            ?au ex:pinakesLabel 'Ptolemaeus Claudius' .
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
            BIND('Ptolemaeus Claudius' AS ?au)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                LIMIT 1
        }
        }
                """ )

pd.DataFrame(result.bindings)

,au,c,ms,shelfmark
0,Euclides,6,http://example.org/id/60423,Staatsbibliothek zu Berlin (Preussischer Kultu...
1,Theodosius Tripolita,4,http://example.org/id/40159,Bibliothèque nationale de France (BNF) suppl. ...
2,Autolycus astronomus,3,http://example.org/id/54144,Biblioteca comunale degli Intronati fonds prin...
3,Ptolemaeus Claudius,6,http://example.org/id/92514,Bodleian Library Cromwell 12

Find all manuscripts containing at least one text from any given grouping of texts. The case below is the 11 Little Astronomy texts. `pinID`s provided to check (`pinakes.irht.cnrs.fr/notices/cote/?pinID/` -- replace `?pinID` with the given number).

In [145]:
pinakes_works = list()
pinakes_works = ('154837','544877','613097','721862','791205','926906','314341','966647','708053','399200','559345','150679')
# Above are the 11 LA works (technically 12 because of Theon's recension of Euclid's Optics)

query = """
PREFIX ex: <http://example.org/vocab/>
        PREFIX exi: <http://example.org/id/>
        PREFIX dc: <http://purl.org/dc/terms/>
        PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
        
        SELECT ?ms (COUNT(*) AS ?c) ?pinID WHERE {
"""

for work in pinakes_works:
    if work == pinakes_works[0]:
        query = query + """
            {
                SELECT ?ms ?wit ?pinID WHERE {
                    ?wit ex:inMS ?ms ;
                         ex:witnessOf exi:%s ;
                         ex:inMS/ex:pinakesID ?pinID . 
                }
            }
        """ % work
    else:
        query = query + """ UNION
            {
                SELECT ?ms ?wit ?pinID WHERE {
                    ?wit ex:inMS ?ms ;
                         ex:witnessOf exi:%s ;
                         ex:inMS/ex:pinakesID ?pinID . 
                }
            }
        """ % work
        
query = query + """
        }
        GROUP BY ?ms
        ORDER BY DESC(?c)
        """




result = g.query(query)

pd.DataFrame(result.bindings)

     c                           ms  pinID
0   11  http://example.org/id/48620  51974
1   11  http://example.org/id/84028  66447
2   11  http://example.org/id/17320  66822
3   11  http://example.org/id/53234  42210
4    9  http://example.org/id/51392  66835
5    8  http://example.org/id/14930  51998
6    8  http://example.org/id/89276  66833
7    7  http://example.org/id/19133  66834
8    7  http://example.org/id/54144  58281
9    6  http://example.org/id/27520  66823
10   6  http://example.org/id/40159  52784
11   5  http://example.org/id/44122  64813
12   5  http://example.org/id/94675  42502
13   5  http://example.org/id/51986  51979
14   5  http://example.org/id/83963  42912
15   4  http://example.org/id/88148  15513
16   4  http://example.org/id/97374  69773
17   4  http://example.org/id/40748  52080
18   4  http://example.org/id/24333  51982
19   4  http://example.org/id/38782  52783
20   4  http://example.org/id/38820  56001
21   4  http://example.org/id/60423   9453
22   4  http://example.org/id/38870  37630
23   4  http://example.org/id/21139  69772
24   3  http://example.org/id/18490  52022
25   3  http://example.org/id/13128  72752
26   3  http://example.org/id/15322  16945
27   3  http://example.org/id/92714  72080
28   2  http://example.org/id/64425  43174
29   2  http://example.org/id/32782  48426
30   2  http://example.org/id/10018   9713
31   2  http://example.org/id/83404  53193
32   2  http://example.org/id/13457  52965
33   2  http://example.org/id/53448  12191
34   2  http://example.org/id/81917  51997
35   2  http://example.org/id/56874  69774
36   1  http://example.org/id/48614  48427
37   1  http://example.org/id/62037  37993
38   1  http://example.org/id/27555  38205
39   1  http://example.org/id/17899  51980
40   1  http://example.org/id/70873  42607
41   1  http://example.org/id/65283  12000
42   1  http://example.org/id/25304  52099
43   1  http://example.org/id/51467  43510
44   1  http://example.org/id/92917  51981
45   1  http://example.org/id/27261  16182
46   1  http://example.org/id/35515  48432
47   1  http://example.org/id/52320  66547
48   1  http://example.org/id/92956  14610
49   1  http://example.org/id/51239  66821
50   1  http://example.org/id/54405  15716
51   1  http://example.org/id/45178  51608

Count how many texts appear in each manuscript. `pinID`s provided to check (`pinakes.irht.cnrs.fr/notices/cote/?pinID/` -- replace `?pinID` with the given number).

In [147]:
result = g.query(
        """
        PREFIX ex: <http://example.org/vocab/>
        PREFIX dc: <http://purl.org/dc/elements/1.1/>
        PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
        SELECT ?ms ?pinID ?shelfmark (COUNT(*) AS ?c) WHERE {
            ?wo dc:creator ?au ;
                ex:pinakesLabel ?l_wo ;
                ex:hasWitness/ex:inMS ?ms .
            ?ms ex:pinakesLabel ?l_ms ;
                ex:locatedIn/skos:prefLabel ?l_inst ;
                ex:pinakesID ?pinID .
            BIND(CONCAT(?l_inst, " ", ?l_ms) AS ?shelfmark)
                }
                GROUP BY ?ms
                ORDER BY DESC(?c)
                """)

pd.DataFrame(result.bindings)

,c,ms,pinID,shelfmark
0,138,http://example.org/id/63517,14971,Real Biblioteca fonds principal ?. I. 13 (Andr...
1,67,http://example.org/id/81231,47363,Bodleian Library Barocci 76
2,57,http://example.org/id/37794,52051,Bibliothèque nationale de France (BNF) gr. 2419
3,55,http://example.org/id/58834,65435,Biblioteca Apostolica Vaticana Ottob. gr. 192
4,54,http://example.org/id/57004,68511,Biblioteca Apostolica Vaticana Vat. gr. 1882
5,47,http://example.org/id/33726,52013,Bibliothèque nationale de France (BNF) gr. 2381
6,45,http://example.org/id/40321,68527,Biblioteca Apostolica Vaticana Vat. gr. 1898
7,38,http://example.org/id/82731,52183,Bibliothèque nationale de France (BNF) gr. 2551
8,37,http://example.org/id/52320,66547,Biblioteca Apostolica Vaticana Urb. gr. 80
9,34,http://example.org/id/17320,66822,Biblioteca Apostolica Vaticana Vat. gr. 191
10,32,http://example.org/id/16561,48178,Bodleian Library Holkham gr. 110
11,30,http://example.org/id/47908,13440,Monê Kosinitsês fonds principal S.N.
12,29,http://example.org/id/80751,44548,Bayerische Staatsbibliothek Cod. graec. 104
13,25,http://example.org/id/94675,42502,Biblioteca Ambrosiana fonds principal C 263 in...
14,24,http://example.org/id/27555,38205,Bibliotheek der Rijksuniversiteit Voss. Misc. 18
15,24,http://example.org/id/92514,47802,Bodleian Library Cromwell 12
16,24,http://example.org/id/68432,64617,Biblioteca Apostolica Vaticana Barb. gr. 69
17,23,http://example.org/id/47576,44549,Bayerische Staatsbibliothek Cod. graec. 105
18,23,http://example.org/id/70307,69805,Biblioteca Nazionale Marciana gr. Z. 334 (coll...
19,21,http://example.org/id/41482,69794,Biblioteca Nazionale Marciana gr. Z. 323 (coll...
20,20,http://example.org/id/94009,16215,Biblioteca Medicea Laurenziana Plut. 28. 34
21,20,http://example.org/id/40382,69275,Biblioteca Apostolica Vaticana Vat. gr. 2644
22,19,http://example.org/id/80433,43201,Biblioteca Ambrosiana fonds principal R 117 su...
23,19,http://example.org/id/53234,42210,Biblioteca Ambrosiana fonds principal A 101 su...
24,19,http://example.org/id/48620,51974,Bibliothèque nationale de France (BNF) gr. 2342
25,19,http://example.org/id/33741,50162,Bibliothèque nationale de France (BNF) gr. 583
26,18,http://example.org/id/44122,64813,Biblioteca Apostolica Vaticana Barb. gr. 267
27,18,http://example.org/id/98003,66544,Biblioteca Apostolica Vaticana Urb. gr. 77
28,18,http://example.org/id/85473,47412,Bodleian Library Barocci 125
29,17,http://example.org/id/58521,67690,Biblioteca Apostolica Vaticana Vat. gr. 1059
...,...,...,...,...
327,1,http://example.org/id/83313,52028,Bibliothèque nationale de France (BNF) gr. 2396
328,1,http://example.org/id/56958,48608,Christ Church College fonds principal 86
329,1,http://example.org/id/71389,9630,Bibliothèque municipale fonds principal 480
330,1,http://example.org/id/89268,15719,Biblioteca Medicea Laurenziana Acq. e Doni 170.2
331,1,http://example.org/id/86332,13724,National Library of Scotland fonds principal A...
332,1,http://example.org/id/10384,46292,Biblioteca Nazionale fonds principal III C 16
333,1,http://example.org/id/78728,46291,Biblioteca Nazionale fonds principal III C 15
334,1,http://example.org/id/83306,46952,Bodleian Library Arch. Seld. B. 44
335,1,http://example.org/id/37146,12570,"Thirlestaine House, coll. Phillipps fonds prin..."
336,1,http://example.org/id/51782,53644,Bibliothèque nationale de France (BNF) suppl. ...
337,1,http://example.org/id/25593,52023,Bibliothèque nationale de France (BNF) gr. 2391
338,1,http://example.org/id/28543,48196,Bodleian Library Langbaine 4
339,1,http://example.org/id/20808,6574,Ethnikê Bibliothêkê tês Hellados (EBE) Metochi...
340,1,http://example.org/id/53632,69782,Biblioteca Nazionale Marciana gr. Z. 311 (coll...
341,1,http://example.org/id/86643,68206,Biblioteca Apostolica Vaticana Vat. gr. 1575
342,1,http://example.org/id/98753,52027,Bibliothèque nationale de France (BNF) gr. 2395
343,1,http://example.org/id/57792,8996,Biblioteca Lolliniana (del Seminario) fonds pr...
344,1,http://example.org/id/13760,16947,Biblioteca Nazionale Centrale Magl. Magliabecc...
345,1,http://example.org/id/65855,46290,Biblioteca Nazionale fonds principal III C 14
346,1,http://example.org/id/86430,64303,Universitätsbibliothek fonds principal Mb 06
347,1,http://example.org/id/41625,37976,Bibliotheek der Rijksuniversiteit Scal. gr. 15
348,1,http://example.org/id/53665,52000,Bibliothèque nationale de France (BNF) gr. 2368
349,1,http://example.org/id/56204,56060,Biblioteca Casanatense fonds principal 455
350,1,http://example.org/id/75856,64468,UB fonds principal gr. 55
351,1,http://example.org/id/17546,68354,Biblioteca Apostolica Vaticana Vat. gr. 1725
352,1,http://example.org/id/83896,45091,Bayerische Staatsbibliothek Cod. graec. 641
353,1,http://example.org/id/37642,53639,Bibliothèque nationale de France (BNF) suppl. ...
354,1,http://example.org/id/37199,42626,Biblioteca Ambrosiana fonds principal D 336 in...
355,1,http://example.org/id/59873,17163,Bibliothêkê tês Koinotêtos fonds principal 28
356,1,http://example.org/id/38962,52908,Bibliothèque nationale de France (BNF) suppl. ...